УчетВУправляющихДляГит1/src/InformationRegisters/ИспользоватьНесколькоБанковскихСчетовОрганизации/ИспользоватьНесколькоБанковскихСчетовОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользоватьНесколькоБанковскихСчетовОрганизации</name>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/ИспользоватьНесколькоБанковскихСчетовОрганизации/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = ОтказИнтерактивногоИзменения(Запись.Организация, Запись.Используется);
	Если Отказ Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'У организации %1 нельзя отключить использование банковских счетов'"),
			Запись.Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОтказИнтерактивногоИзменения(Знач Организация, Знач Используется)
	
	Если Используется ИЛИ НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат РегистрыСведений.ИспользоватьНесколькоБанковскихСчетовОрганизации.ОтказИнтерактивногоИзменения(Организация);
	
КонецФункции

#КонецОбласти
